[
  {
    "title": "Front End Developer",
    "company": "PNYX",
    "location": "Tempe,AZ",
    "date": "July 2023 - Present",
    "description": [
      "Spearhead front-end development for a music streaming web app utilizing React, Flask, and PostgreSQL.",
      "Enhance user engagement by creating a visually immersive 3D background using CSS techniques.",
      "Utilize React Router for efficient navigation between pages, facilitating a smooth user journey.",
      "Integrated ThirdwebWallet, aWeb3 authentication solution withWeb2 UX, for secure and decentralized user login.",
      "Implemented Docker to containerize project environment, leading to a 50% reduction in onboarding time and setup."
    ]
  },
  {
    "title": "Software Developer Intern",
    "company": "Szymon Zephan Capital Group",
    "location": "New York City, NY",
    "date": "January 2023 - May 2023",
    "description": [
      "Developed dashboard for Customer Relationship Management (CRM) web app using React, including interactive charts and graphs created with react-chartjs2.",
      "Contributed to backend architecture of CRM dashboard, defining data models, relationships & developing secure REST API.",
      "Created bulk data insertion from Excel sheets with robust pessimistic locking mechanism and tested using Apache JMeter, preventing data conflicts and boosting user productivity by 80%.",
      "Developed unit and integration test cases using Django test and unittest, resulting reduction in API errors."
    ]
  },
  {
    "title": "Web Developer",
    "company": "Intrisol",
    "location": "Ahmedabad, India",
    "date": "June 2020 - June 2021",
    "description": [
      "Developed mobile-responsive product and cart page for e-commerce web app from design mock ups using React.",
      "Worked closely with backend developers to integrate front-end code with server-side logic using RESTful APIs.",
      "Utilized CSS preprocessors like Sass to streamline style sheet management and improve code maintainability.",
      "Maintained website content with GitHub and CI/CD, displaying an ability to adapt to evolving project requirements."
    ]
  }
]
